#1
""" Напишите программу, которая принимает на вход цифру, обозначающую день недели,
и проверяет, является ли этот день выходным.
- 6 -> да
- 7 -> да
- 1 -> нет """

num = int(input())
if num == 6 or num == 7:
    print('Да')
else:
    print('Нет')

#2
""" Напишите программу для. проверки истинности утверждения 
¬(X ⋁ Y ⋁ Z) = ¬X ⋀ ¬Y ⋀ ¬Z для всех значений предикат. """

print('Введите х: ')
x = int(input())
print('Введите у: ')
y = int(input())
print('Введите z: ')
z = int(input())

if x >= 0 and y >= 0 and z >= 0:
    if (x + y + z) <= 3:
        print(not (x or y or z) == (not x and not y and not z))
else:
    print('Некорректный ввод')

#3
""" Напишите программу, которая принимает на вход координаты точки (X и Y), 
причём X ≠ 0 и Y ≠ 0 и выдаёт номер четверти плоскости, в которой находится эта
точка (или на какой оси она находится).

- x=34; y=-30 -> 4
- x=2; y=4-> 1
- x=-34; y=-30 -> 3 """

print('Введите х: ')
x = int(input())
print('Введите y: ')
y = int(input())

if x and y != 0:
    if x > 0 and y > 0:
        print('1')
    if x < 0 and y > 0:
        print('2')
    if x > 0 and y < 0:
        print('4')
    if x < 0 and y < 0:
        print('3')
else:
    print('Некорректный ввод')

#4
""" Напишите программу, которая по заданному номеру четверти, показывает диапазон
возможных координат точек в этой четверти (x и y). """

print('Введите номер четверти: ')
n = int(input())
if n == 1 or n == 2 or n == 3 or n == 4:
    if n == 1:
        print ('x=(0:+∞), y=(0:+∞)')
    if n == 2:
        print ('x=(-∞:0), y=(0:+∞)')
    if n == 3:
        print ('x=(-∞:0), y=(-∞:0)')
    if n == 4:
        print ('x=(0:+∞), y=(-∞:0)')
else:
    print('Некорректный ввод')

#5
""" Напишите программу, которая принимает на вход координаты двух точек и находит
расстояние между ними в 2D пространстве. """

print('Введите координату первой точки через пробел: ')
tochka1 = input().split(' ')
x1 = float(tochka1[0])
y1 = float(tochka1[1])

print('Введите координату второй точки через пробел: ')
tochka2 = input().split(' ')
x2 = float(tochka2[0])
y2 = float(tochka2[1])

distance = float((x2 - x1)**2 + (y2 - y1)**2)

import math
result = math.sqrt(distance)
print(round(result, 2))